cask_args appdir: '/Applications'

# brew tap(s)
tap 'homebrew/cask'
# for font support
tap 'homebrew/cask-fonts'
# for cask version support
tap 'homebrew/cask-versions'

# regular brew(s)
brew 'mas'
brew 'node'
# commenting out as cargo's hard link causes issues
# brew 'rustup-init'
brew 'doctl'
brew 'pnpm'
brew 'pwgen'
brew 'sqlite'
brew 'tree'
brew 'tmux'
brew 'wget'

# application cask(s)
cask 'balenaetcher'
cask 'cyberduck'
cask 'discord'
cask 'docker'
cask 'drawio'
cask 'eloston-chromium'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'keka'
cask 'lastpass'
cask 'local'
cask 'logi-options+'
cask 'notion'
cask 'numi'
cask 'obsidian'
cask 'postico'
cask 'postgres-unofficial'
cask 'postman'
cask 'proton-drive'
cask 'proton-mail'
cask 'proton-pass'
cask 'protonvpn'
cask 'rectangle'
cask 'slack'
cask 'tg-pro'
# Need to Manually Install Pro Version
# cask 'turbo-boost-switcher'
cask 'visual-studio-code'
cask 'warp'
cask 'zoom'

# font cask(s)
cask 'font-b612'
cask 'font-b612-mono'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-fira-code-nerd-font'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-lato'
cask 'font-overpass'
cask 'font-overpass-mono'
cask 'font-raleway'
cask 'font-roboto-slab'
cask 'font-zilla-slab'

# Mac App Store app(s)
mas 'Amphetamine', id: 937984704
mas 'Calcbot', id: 931657367
mas 'Textual 7', id: 1262957439
mas 'Microsoft OneDrive', id: 823766827
mas 'Microsoft OneNote', id: 784801555
mas 'Microsoft Outlook', id: 985367838
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Remote Desktop', id: 1295203466
# Literally failed on the last item!
# mas 'Microsoft To Do', id: 1274495053
